Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItem Class
 The MaterialMarketSizesItem class contains information about the available market sizes for particular material.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.MaterialMarketSizesItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class MaterialMarketSizesItem
<SerializableAttribute>
Public NotInheritable Class MaterialMarketSizesItem
The MaterialMarketSizesItem type exposes the following members.
Properties
Name | Description
MarketSizes
 Available MarketSizes for the particular material
MaterialName
 Material name
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace